БухЭксп/Catalogs/CW_Заявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Заявки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыБюджетовПоЗаявкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПеревозок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗаявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровЗаявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыПеревозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыПеревозок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_События.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_События</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_КонтактыеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_Заявки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		
		ОсновнойТипГрузоперевозки = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойТипГрузоперевозки");
		Если ОсновнойТипГрузоперевозки <> Неопределено Тогда
			
			// проверяем, что основной тип перевозки доступен пользователю
			ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());
			Если (ГруппаПользователя.ОграничениеПоТипамГрузоперевозок) Тогда
				
				МассивДоступныхТипов = Новый Массив;
				Для каждого Стр Из ГруппаПользователя.ДоступныеТипыГрузоперевозок Цикл
					МассивДоступныхТипов.Добавить(Стр.ТипГрузоперевозки);
				КонецЦикла; 
				
				Если (МассивДоступныхТипов.Найти(ОсновнойТипГрузоперевозки) = Неопределено) Тогда
					
					ОсновнойТипГрузоперевозки = Справочники.CW_ТипыПеревозок.ПустаяСсылка();
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТипПеревозки = ОсновнойТипГрузоперевозки;
			
		КонецЕсли; 
		
		ОсновнойМенеджерПродаж = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойМенеджерПродаж");
		Если (ОсновнойМенеджерПродаж <> Неопределено) Тогда
			МенеджерПродаж = ОсновнойМенеджерПродаж;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТипПеревозки) Тогда
		_УФС.ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(ЭтотОбъект, ТипПеревозки, "ДляЗаявки");
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаОбращения = ТекущаяДата();

	Статус = Неопределено;
	СтатусПодтверждения = Неопределено;

	ПлановаяДатаОценки = Неопределено;
	ФактическаяДатаОценки = Неопределено;

	ПлановаяДатаОтправкиОценки = Неопределено;
	ФактическаяДатаОтправкиОценки = Неопределено;

	ПлановаяДатаПодтверждения = Неопределено;
	ФактическаяДатаПодтверждения = Неопределено;

	ПлановаяДатаВыполнения = Неопределено;
	ФактическаяДатаВыполнения = Неопределено;

	ВариантБюджета = Неопределено;
	Архив = Ложь;
	
	Для каждого Стр Из ПараметрыЗаявки Цикл
		
		Если Стр.Параметр.ОчищатьПриКопировании Тогда
			
			Стр.Значение		= Стр.Параметр.ТипЗначения.ПривестиЗначение(Неопределено); 
			Стр.ЗначениеПлан	= Дата(1,1,1);
			Стр.ЗначениеФакт	= Дата(1,1,1);
			Стр.Примечание		= "";
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Конецесли;

	Если НЕ ЗначениеЗаполнено(Код) Тогда 
		УстановитьНовыйКод();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Наименование) тогда
		Наименование = "Заявка №"+Код+" от "+Формат(ДатаОбращения,"ДФ=dd.MM.yyyy");
	КонецЕсли;

	Если (ТипПеревозки.ВидПеревозки <> Перечисления.CW_ВидыПеревозок.Контейнер) Тогда
		Типоразмер = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры   

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Конецесли;
	
	// по заявке AFR-240194
	ОбработатьСнятиеПометкуУдаленияЗаявки();
	//-- по заявке AFR-240194
	
	// ---------------------------------------------------------------------------- 
	// перенесём параметры в регистр параметров
	
	НаборЗаписей = РегистрыСведений.CW_ХарактеристикиЗаявок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Значение = Ссылка;
	НаборЗаписей.Отбор.Заявка.Использование = Истина;
	
	Инетрактивно = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"Инетрактивно",Ложь);
	
	Если Не Инетрактивно Тогда
		ОбновитьДинамическиеПараметры();
	КонецЕсли;
	
	тз = ПараметрыЗаявки.Выгрузить();
	// --- 
	МассивДинамическихПараметров = Неопределено;
	_сф.ДС(ЭтотОбъект).Свойство("МассивДинамическихПараметров",МассивДинамическихПараметров);
	Если (МассивДинамическихПараметров <> Неопределено) Тогда
		МассивУдаления = Новый Массив;
		Для каждого Стр Из тз Цикл
			Если (МассивДинамическихПараметров.Найти(Стр.Параметр)<>Неопределено) Тогда
				МассивУдаления.Добавить(Стр);
			КонецЕсли; 
		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоМассиву(тз,МассивУдаления);	
	КонецЕсли; 
	// --- 
	// добавляем движение по служебному	парамеру,чтобы работал поиск ***
	Нстр = тз.Добавить();
	Нстр.Параметр = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.Служебный;
	Нстр.Значение = Ложь;
	// --- 
	// пока не используются
	//ДобавитьЗаписиПоДинамическимПараметрам(тз,МассивДинамическихПараметров,_сф.ДС(ЭтотОбъект).СоответствиеСвойствПараметров);
	// --- 
	тз.Колонки.Добавить("Заявка");
	тз.ЗаполнитьЗначения(Ссылка, "Заявка");
	
	НаборЗаписей.Очистить();
	
	//Дополняем данные хранилища значений
	Для Каждого СтрокаПараметров из тз Цикл
		
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора,СтрокаПараметров,,"ХранилищеДанных");
		
		//Новый механизм
		СтрокаНабора.Порядок = СтрокаПараметров.НомерСтроки;
		//Новый механизм
	
		//Записываем данны из хранилизазанчений
		Отбор = Новый Структура("Параметр",СтрокаПараметров.Параметр);
		мСтроки = ПараметрыЗаявки.НайтиСтроки(Отбор);
		//Должна быть одна строка
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0]; 
			СтрокаНабора.ХранилищеДанных = новый ХранилищеЗначения(СтрокаДанных.ХранилищеДанных.Получить());	
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
	// ---------------------------------------------------------------------------- 
	
	КопироватьБюджеты = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"КопироватьБюджеты",Ложь);
	Если (КопироватьБюджеты) Тогда
		
		МассивВариантов = ДополнительныеСвойства.КопироватьБюджетыМассивВариантов;
		
		Для каждого СтрВариантБюджета Из МассивВариантов Цикл
			
			СобственныйВариантБюджета = СтрВариантБюджета.Скопировать();
			СобственныйВариантБюджета.Владелец = Ссылка;
			СобственныйВариантБюджета.Записать();
			// --- 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка
			|ИЗ
			|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
			|ГДЕ
			|	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец
			|	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ";
			Запрос.УстановитьПараметр("Владелец", СтрВариантБюджета);
			// --- 
			ТЗ = Запрос.Выполнить().Выгрузить();
			Для каждого Стр Из ТЗ Цикл
				
				СобственнаяСтатья = Стр.Ссылка.Скопировать();
				СобственнаяСтатья.Владелец = СобственныйВариантБюджета.Ссылка;
				СобственнаяСтатья.Записать();
				
			КонецЦикла; 
			 
			
		КонецЦикла;
		
		ДополнительныеСвойства.КопироватьБюджеты = Ложь;
		
	КонецЕсли; 
		
	ПроверитьЗаполнениеПараметров(Отказ);

КонецПроцедуры

Процедура ПроверитьЗаполнениеПараметров(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ТипыПеревозокПараметрыЗаявки.Параметр КАК Параметр,
	               |	ВЫБОР
	               |		КОГДА CW_ЗаявкиПараметрыЗаявки.Параметр ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК НаличиеПараметра,
	               |	ВЫБОР
	               |		КОГДА НЕ CW_ЗаявкиПараметрыЗаявки.Параметр ЕСТЬ NULL
	               |			ТОГДА CW_ЗаявкиПараметрыЗаявки.Значение
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК ЗначениеПараметра,
	               |	CW_ЗаявкиПараметрыЗаявки.НомерСтроки КАК НомерСтрокиЗаказа
	               |ИЗ
	               |	Справочник.CW_ТипыПеревозок.ПараметрыЗаявки КАК CW_ТипыПеревозокПараметрыЗаявки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CW_Заявки.ПараметрыЗаявки КАК CW_ЗаявкиПараметрыЗаявки
	               |		ПО CW_ТипыПеревозокПараметрыЗаявки.Параметр = CW_ЗаявкиПараметрыЗаявки.Параметр
	               |			И (CW_ЗаявкиПараметрыЗаявки.Ссылка = &Заказ)
	               |ГДЕ
	               |	CW_ТипыПеревозокПараметрыЗаявки.Ссылка = &ТипПеревозки
	               |	И CW_ТипыПеревозокПараметрыЗаявки.КонтрольЗаполнения = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТипПеревозки", ТипПеревозки);
	Запрос.УстановитьПараметр("Заказ", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.НаличиеПараметра Тогда
			ШаблонТекста = "В заказе %1 отсутствует параметр, обязательный для заполнения %2";
			ТекстСообщения = СтрШаблон(ШаблонТекста, Ссылка, Выборка.Параметр);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Иначе
			Если Не ЗначениеЗаполнено(Выборка.ЗначениеПараметра) Тогда
				ШаблонТекста = "В заказе %1 не заполнен параметр, обязательный для заполнения %2";
				ТекстСообщения = СтрШаблон(ШаблонТекста, Ссылка, Выборка.Параметр);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьДинамическиеПараметры()
	
	КартаСвойствПараметров 			= CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
	ТаблицаДинамическихПараметров 	= CW_Мониторинг.ДинамическиеПараметрыОбъекта(ЭтотОбъект,КартаСвойствПараметров,,ПараметрыЗаявки.Выгрузить());
	
	Для Каждого СтрокаПараметров из ТаблицаДинамическихПараметров Цикл
		
		НайденнаяСтрока = ПараметрыЗаявки.Найти(СтрокаПараметров.Параметр, "Параметр"); 

		Если НайденнаяСтрока <> Неопределено Тогда
			НайденнаяСтрока.Значение =  СтрокаПараметров.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
// ---------------------------------------------------------------------------- 

Процедура ПроверитьИерархиюПараметров() Экспорт 
	// --- 
	
	Если (ГруппыПараметровЗаявки.Количество()=0) Тогда
		
		// требуется сформировать группы по текущей иерархии параметров
		
		// добавляем корневой элемент
		КорневаяГруппа = ГруппыПараметровЗаявки.Добавить();
		КорневаяГруппа.Идентификатор = 0;
		КорневаяГруппа.ИдентификаторВедущего=0;
		КорневаяГруппа.Наименование = "Корень";
		КорневаяГруппа.Раскрывать = Истина;
		
		// получаем родителей текущих параметров
		ТЗП = ПараметрыЗаявки.Выгрузить();
		ТЗП.Колонки.Добавить("Код");
		ТЗП.Колонки.Добавить("Родитель");
		ТЗП.Колонки.Добавить("КодРодителя");
		Для каждого Стр Из ТЗП Цикл
			
			Стр.Код = Стр.Параметр.Код;
			Стр.Родитель = Стр.Параметр.Родитель;
			Стр.КодРодителя = Стр.Родитель.Код;
			
		КонецЦикла; 
		
		ТЗР = ТЗП.Скопировать(,"Родитель,КодРодителя");
		ТЗР.Свернуть("Родитель,КодРодителя");
		ТЗР.Сортировать("КодРодителя Возр");
		// --- 
		МассивГруппВерхнегоУровня = Новый Массив;
		ЕстьПустойРодитель = Ложь;
		МассивПараметровБезРодителя = Новый Массив;
		Индекс = 1;
		Для каждого СтрРодитель Из ТЗР Цикл
			
			Отбор = Новый Структура("Родитель",СтрРодитель.Родитель);
			// --- 
			Если (СтрРодитель.Родитель.Пустая()) Тогда
				
				ЕстьПустойРодитель=Истина;
				ТЗПБР = ТЗП.Скопировать(Отбор);
				ТЗПБР.Сортировать("Код Возр");
				Для каждого СтрПБР Из ТЗПБР Цикл
					МассивПараметровБезРодителя.Добавить(Стр.Параметр);
				КонецЦикла;
				
			Иначе
				
				// создаем
				Нстр = ГруппыПараметровЗаявки.Добавить();
				Нстр.Идентификатор = Индекс;
				_сф.Инкремент(Индекс);
				Нстр.ИдентификаторВедущего = 0;
				Нстр.Раскрывать = Истина;
				// --- 
				Нстр.Наименование = Строка(СтрРодитель.Родитель);
				
				// формируем подчиненные
				ТЗПР = ТЗП.Скопировать(Отбор);
				ТЗПР.Сортировать("Код Возр");
				// --- 
				МассивПараметров = ТЗПР.ВыгрузитьКолонку("Параметр");
				Нстр.ИдентификаторыВедомых=ЗначениеВСтрокуВнутр(МассивПараметров);
				
				МассивГруппВерхнегоУровня.Добавить(Нстр);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		// --- 
		
		МассивЭлементовВерхнегоУровня = Новый Массив;
		Для каждого СтрРодитель Из МассивГруппВерхнегоУровня Цикл
			
			МассивЭлементовВерхнегоУровня.Добавить(СтрРодитель.Идентификатор);
			
		КонецЦикла; 
		Если (МассивПараметровБезРодителя.Количество()<>0) Тогда
			
			Для каждого Параметр Из МассивПараметровБезРодителя Цикл
				
				МассивЭлементовВерхнегоУровня.Добавить(Параметр);
				
			КонецЦикла; 
			
		КонецЕсли; 
		КорневаяГруппа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивЭлементовВерхнегоУровня);
		// --- 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

Процедура ОбработатьСнятиеПометкуУдаленияЗаявки()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_События.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_События КАК CW_События
	               |ГДЕ
	               |	CW_События.ОбъектСобытия = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Ссылка);  
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СобытиеОбъект = Выборка.Ссылка.ПолучитьОбъект(); 
		СобытиеОбъект.ОбменДанными.Загрузка = Истина;
		СобытиеОбъект.УстановитьПометкуУдаления(ПометкаУдаления);	
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
